**Рішення завдання №1**

In [14]:
#!pip install names

In [1]:
import pandas as pd
import numpy as np
import names

#### 1.Створюємо датафрейм із даними

In [2]:
students = {
    "Name Surnam": [names.get_full_name() for _ in range(15)],
    "Middle points": np.random.randint(70, size=15),
    "Point exam": np.random.randint(80, size=15),
    "Try:number": np.random.randint(4, size=15)
}

df = pd.DataFrame.from_dict(students)
df

        Name Surnam  Middle points  Point exam  Try:number
0     Darla Johnson             63          44           3
1      Debra Medina              1           6           1
2      Jacklyn Earl             17          54           3
3     Robert Groves             37          49           3
4   Rebecca Goodman             40          28           2
5        Ina Griggs             29          41           1
6       Etta Morris             68          78           1
7   Gordon Hargrave             45          10           1
8      Elsie Gordon             69          53           2
9   Annette Eubanks             52          64           1
10   Katherine Frye             27          68           1
11     Jack Dorsett             34          76           2
12    Carol Stanger             26          25           0
13     Trinh Bryant             66          20           1
14  Mildred Burkett             54          21           1

#### 2.Додамо до датафрейму стовпчик, що містить дані про допуск студента на наступний курс

In [5]:
df["Next year"] = ["yes","yes","yes","yes","yes","yes","yes","yes","yes","yes","yes","yes","yes","yes","yes"]
df

        Name Surnam  Middle points  Point exam  Try:number Next year
0     Darla Johnson             63          44           3       yes
1      Debra Medina              1           6           1       yes
2      Jacklyn Earl             17          54           3       yes
3     Robert Groves             37          49           3       yes
4   Rebecca Goodman             40          28           2       yes
5        Ina Griggs             29          41           1       yes
6       Etta Morris             68          78           1       yes
7   Gordon Hargrave             45          10           1       yes
8      Elsie Gordon             69          53           2       yes
9   Annette Eubanks             52          64           1       yes
10   Katherine Frye             27          68           1       yes
11     Jack Dorsett             34          76           2       yes
12    Carol Stanger             26          25           0       yes
13     Trinh Bryant             66          20           1       yes
14  Mildred Burkett             54          21           1       yes

#### 3.Виведемо мінімальний, максимальний та середній показники середнього балу студентів

In [6]:
df.agg({ "Middle points" : ["min","max","median"]})

        Middle points
min               1.0
max              69.0
median           40.0

#### 4.Виведемо кількість студентів,що здали поточний екзамен з першого разу та порахуємо

In [10]:
students_1 = df.loc[df["Try:number"] == 1, "Name Surnam"]
students_1

1        Debra Medina
5          Ina Griggs
6         Etta Morris
7     Gordon Hargrave
9     Annette Eubanks
10     Katherine Frye
13       Trinh Bryant
14    Mildred Burkett
Name: Name Surnam, dtype: object

In [11]:
df.groupby(df["Try:number"]==1)["Try:number"].count()

Try:number
False    7
True     8
Name: Try:number, dtype: int64

#### 5.Збережемо деякі дані із датафрейму у вигляді серії

In [13]:
my_students = df["Name Surnam"]
my_students

0       Darla Johnson
1        Debra Medina
2        Jacklyn Earl
3       Robert Groves
4     Rebecca Goodman
5          Ina Griggs
6         Etta Morris
7     Gordon Hargrave
8        Elsie Gordon
9     Annette Eubanks
10     Katherine Frye
11       Jack Dorsett
12      Carol Stanger
13       Trinh Bryant
14    Mildred Burkett
Name: Name Surnam, dtype: object